/*==============================================================================

   頂点管理[CookTorrance.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"
#include "model.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


////////////////
//構造体
////////////////


class DisneyPBRModel
{
protected:
	XMFLOAT3	Position;
	XMFLOAT3	Scale;
	XMFLOAT3	Rotate;
	int			TexID;



	MODEL* Model;

public:

	HRESULT InitPolygonModel(void);
	void FinalizePolygonModel(void);
	void UpdatePolygonModel(void);
	void DrawPolygonModel(void);



};







//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

